{
	"name": "Streadata.io API Gallery - Private Virtual Interfaces",
	"description": "This is a repository of private virtual interfaces APIs, self-contained as a Github repository, with HTML and YAML representations of the APIs and their surrounding operations.",
	"image": "http://template.streamdata.gallery/assets/private-virtual-interfaces.png",
	"created": "2018-02-24",
	"modified": "2018-08-28",
	"url": "http://private-virtual-interfaces.streamdata.gallery/apis.json",
	"specificationVersion": "0.14",
	"apis": [
		{
			"name": "AWS Direct Connect",
			"x-api-slug": "aws-direct-connect",
			"description": "AWS Direct Connect makes it easy to establish a dedicated network connection from your premises to AWS. Using AWS Direct Connect, you can establish private connectivity between AWS and your datacenter, office, or colocation environment, which in many cases can reduce your network costs, increase bandwidth throughput, and provide a more consistent network experience than Internet-based connections.AWS Direct Connect lets you establish a dedicated network connection between your network and one of the AWS Direct Connect locations. Using industry standard 802.1q VLANs, this dedicated connection can be partitioned into multiple virtual interfaces. This allows you to use the same connection to access public resources such as objects stored in Amazon S3 using public IP address space, and private resources such as Amazon EC2 instances running within anAmazon Virtual Private Cloud (VPC)using private IP space, while maintaining network separation between the public and private environments. Virtual interfaces can be reconfigured at any time to meet your changing needs.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Networking_AWSDirectConnect.png",
			"humanURL": "https://aws.amazon.com/directconnect/",
			"baseURL": ":///",
			"tags": "Private Virtual Interfaces",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/private-virtual-interfaces/master/_listings/aws-direct-connect/openapi.md"
				}
			]
		}
	],
	"tags": "Private Virtual Interfaces",
	"include": [
		{
			"name": "AWS Direct Connect",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/private-virtual-interfaces/master/_listings/aws-direct-connect/apis.yaml"
		}
	]
}